security-reports/hey-test-result.txt

Summary:
  Total:	0.0661 secs
  Slowest:	0.0197 secs
  Fastest:	0.0001 secs
  Average:	0.0030 secs
  Requests/sec:	15132.4563
  

Response time histogram:
  0.000 [1]	|
  0.002 [443]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [360]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.006 [116]	|■■■■■■■■■■
  0.008 [21]	|■■
  0.010 [16]	|■
  0.012 [12]	|■
  0.014 [12]	|■
  0.016 [12]	|■
  0.018 [3]	|
  0.020 [4]	|


Latency distribution:
  10%% in 0.0008 secs
  25%% in 0.0013 secs
  50%% in 0.0023 secs
  75%% in 0.0036 secs
  90%% in 0.0055 secs
  95%% in 0.0091 secs
  99%% in 0.0156 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.0000 secs, 0.0050 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0025 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0043 secs
  resp wait:	0.0020 secs, 0.0001 secs, 0.0159 secs
  resp read:	0.0007 secs, 0.0000 secs, 0.0052 secs

Status code distribution:
  [200]	1000 responses



Summary:
  Total:	0.0616 secs
  Slowest:	0.0105 secs
  Fastest:	0.0002 secs
  Average:	0.0029 secs
  Requests/sec:	16226.4785
  

Response time histogram:
  0.000 [1]	|
  0.001 [143]	|■■■■■■■■■■■■■■■■■■■■■
  0.002 [278]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [275]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [152]	|■■■■■■■■■■■■■■■■■■■■■■
  0.005 [59]	|■■■■■■■■
  0.006 [39]	|■■■■■■
  0.007 [16]	|■■
  0.008 [24]	|■■■
  0.009 [12]	|■■
  0.011 [1]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0017 secs
  50%% in 0.0025 secs
  75%% in 0.0036 secs
  90%% in 0.0053 secs
  95%% in 0.0066 secs
  99%% in 0.0086 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0022 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0012 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0027 secs
  resp wait:	0.0021 secs, 0.0002 secs, 0.0079 secs
  resp read:	0.0005 secs, 0.0000 secs, 0.0053 secs

Status code distribution:
  [200]	1000 responses